000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботаВыполняемаяСотрудниками/РаботаВыполняемаяСотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РаботаВыполняемаяСотрудниками</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ОсновноеМестоРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РаботаВыполняемаяСотрудниками</name>
    <type>
      <types>CatalogRef.РаботаВыполняемаяСотрудниками</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/РаботаВыполняемаяСотрудниками/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ОсновноеМестоРаботы тогда 
		Сотрудник = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийОбъект.Сотрудник, "Сотрудник");
		ЕстьЗапись = ПроверитьОсновноеМестоРаботы(Сотрудник);
	 	Если  ЕстьЗапись тогда
			Сообщить("Уже существкует запись с основным местом работы!");
			Отказ = Истина; 
		КонецЕсли; 
	КонецЕсли;
КонецПроцедуры


Функция  ПроверитьОсновноеМестоРаботы(сотрудник)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Таб.РаботаВыполняемаяСотрудниками
		|ИЗ
		|	РегистрСведений.РаботаВыполняемаяСотрудниками КАК Таб
		|ГДЕ
		|	Таб.Сотрудник = &Сотрудник
		|	И Таб.ОсновноеМестоРаботы = ИСТИНА";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
		
КонецФункции
